       01 ZIP-CODE-TBL.
          02 ZIP-ROW  OCCURS 72 TIMES .
               10 STATE         PIC X(16).
               10 STATE-AC      PIC X(4).
               10 ZIP-LOW       PIC X(8).
               10 ZIP-HIGH      PIC X(5).
